package com.prokhorovgm.weather_analyzer.model;

import lombok.AccessLevel;
import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.experimental.FieldDefaults;

import java.util.Arrays;
import java.util.List;

@AllArgsConstructor
@FieldDefaults(makeFinal = true, level = AccessLevel.PRIVATE)
@Getter
public enum ActionType {
    DRIVE(Arrays.asList(
        "Гололед", "Затор", "Ледяная корка", "Метель", "Ливень", "Наледи", "Образование снежного покрова", "Оползни",
        "Отрыв льда", "Паводок", "Половодье", "Продолжительный дождь", "Пыльная буря", "Раннее ледообразование",
        "Сгонные явления", "Сель", "Сход снежных лавин", "Туман"
    )),
    PLANT(Arrays.asList(
        "Аномально-жаркая погода", "Аномально-холодная погода", "Вымерзание растений", "Выпревание растений",
        "Высокий уровень рек", "Град", "Заморозки", "Засуха почвенная", "Оползни", "Переувлажнение почвы",
        "Раннее ледообразование", "Сильная жара", "Сильный мороз"
    ));

    List<String> fact;

    /*[
        "Аномально-жаркая погода",
        "Аномально-холодная погода",
        "Ветер",
        "Вымерзание растений",
        "Выпревание растений",
        "Высокий уровень рек",
        "Гололед",
        "Гололедица",
        "Град",
        "Гроза",
        "Дождь",
        "Зажор",
        "Заморозки",
        "Засуха атмосферная",
        "Засуха почвенная",
        "Затор",
        "КМЯагро",
        "КНЯ",
        "Ледяная корка",
        "Ливень",
        "Метель",
        "Нагонные явления",
        "Наледи",
        "Низкая межень",
        "Образование снежного покрова",
        "Оползни",
        "Отрыв льда",
        "Паводок",
        "Переувлажнение почвы",
        "Половодье",
        "Продолжительный дождь",
        "Пыльная буря",
        "РИП",
        "Раннее ледообразование",
        "Резкое повышение температуры",
        "Резкое понижение температуры",
        "Сгонные явления",
        "Сель",
        "Сильная жара",
        "Сильное волнение",
        "Сильный мороз",
        "Сложные отложения",
        "Смерч",
        "Смешанные осадки",
        "Снег",
        "Суховей",
        "Сход снежных лавин",
        "Туман",
        "Чрезвычайная пожароопасность"
        ]*/
}
